## Plan Result (prod_shutter_webapp)




<pre><code>Plan: 5 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * module.static_webapp.azurerm_dns_cname_record.cname_record[&#34;et-response-pet&#34;]
  * module.static_webapp.azurerm_dns_txt_record.zone_validate[&#34;et-response-pet&#34;]
  * module.static_webapp.azurerm_static_site.swebapp[&#34;et-response-pet&#34;]
  * module.static_webapp.azurerm_static_site_custom_domain.custom_domain[&#34;et-response-pet&#34;]
  * module.static_webapp.github_actions_secret.secret[&#34;et-response-pet&#34;]
* Update
  * module.static_webapp.azurerm_dns_txt_record.zone_validate[&#34;div-pfe&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.static_webapp.azurerm_dns_cname_record.cname_record["et-response-pet"] will be created
  + resource "azurerm_dns_cname_record" "cname_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "tribunal-response-shutter"
      + record              = (known after apply)
      + resource_group_name = "reformMgmtRG"
      + ttl                 = 300
      + zone_name           = "employmenttribunals.service.gov.uk"
    }

  # module.static_webapp.azurerm_dns_txt_record.zone_validate["div-pfe"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "zone_validate" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/apply-divorce.service.gov.uk/TXT/_dnsauth.www"
        name                = "_dnsauth.www"
        tags                = {}
      ~ ttl                 = 3600 -> 300
        # (3 unchanged attributes hidden)

      - record {
          - value = "5bz95ky3c27gb6475yz0yx2x1g4wg6qc" -> null
        }
      + record {
          + value = "validated"
        }
    }

  # module.static_webapp.azurerm_dns_txt_record.zone_validate["et-response-pet"] will be created
  + resource "azurerm_dns_txt_record" "zone_validate" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth.tribunal-response"
      + resource_group_name = "reformMgmtRG"
      + ttl                 = 300
      + zone_name           = "employmenttribunals.service.gov.uk"

      + record {
          + value = (known after apply)
        }
    }

  # module.static_webapp.azurerm_static_site.swebapp["et-response-pet"] will be created
  + resource "azurerm_static_site" "swebapp" {
      + api_key             = (sensitive value)
      + default_host_name   = (known after apply)
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = "et-response-pet"
      + resource_group_name = "cft-platform-shutter-webapp-prod-rg"
      + sku_size            = "Standard"
      + sku_tier            = "Standard"
      + tags                = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
    }

  # module.static_webapp.azurerm_static_site_custom_domain.custom_domain["et-response-pet"] will be created
  + resource "azurerm_static_site_custom_domain" "custom_domain" {
      + domain_name      = "tribunal-response.employmenttribunals.service.gov.uk"
      + id               = (known after apply)
      + static_site_id   = (known after apply)
      + validation_token = (sensitive value)
      + validation_type  = "dns-txt-token"
    }

  # module.static_webapp.github_actions_secret.secret["et-response-pet"] will be created
  + resource "github_actions_secret" "secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "azure-shutter-pages"
      + secret_name     = "et_response_pet_prod"
      + updated_at      = (known after apply)
    }

Plan: 5 to add, 1 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1706,"Program":"tfcmt","SHA1":"","Target":"prod_shutter_webapp","Vars":{}} -->